var answer = 250;
var dot_data = [[1,1,2,0,1],
				[2,7,0,1,0],
				[2,4,0,0,1],
				[3,1,11,0,1],
				[9,3,0,0,1],
				[5,7,1,0,1],
				[10,2,2,0,0],
				[13,2,0,1,0],
				[7,5,14,1,1],
				[14,6,5,0,0],
				[4,4,6,0,0],
				[11,4,13,0,1],
				[6,3,4,0,1]];
var line_data= [[0,1],
				[1,2],
				[4,6],
				[7,6],
				[0,3],
				[8,5],
				[3,4],
				[5,11],
				[10,2],
				[8,6],
				[8,12],
				[2,12],
				[4,12],
				[3,12],
				[3,7],
				[7,11],
				[11,4],
				[10,8],
				[11,9],
				[9,5],
				[7,9],
				[5,2],
				];	
var level=2;
var diff='困難';
var task=[{mode:1,name:"青蛙先生", str:"幫忙加密這隻青蛙的號碼，不要被魚王看出來!\n任務1：\n首先要讓每個節點數字，加起來等於250。\n(小提示：點擊原點可修改樹葉的值，寫好了再按右方答案確定唷~)"},
		{mode:2,name:"加密號碼", str:"幫忙加密這隻青蛙的號碼，不要被魚王看出來!\n任務2：\n再把所有節點和相鄰的加在一起。\n(小提示：點擊原點可修改樹葉的值，寫好了再按右方答案確定唷~)"}];

var next_page = "../advanced_challenge_level_select.html";
var fail_page = "adv_lose.html";