var answer = 210;
var dot_data = [[1,1,6,0,1],
				[12,7,7,0,0],
				[3,4,10,0,1],
				[13,2,11,0,1],
				[6,3,9,0,1],
				[5,7,1,1,1],
				[7,1,2,1,0],
				[8,5,3,0,0],
				[10,1,15,0,0],
				[11,4,13,1,0]];
var line_data= [[3,1],
                [7,1],
                [7,9],
				[1,2],
				[1,5],
				[4,6],
				[0,6],
				[0,2],
				[2,5],
				[3,4],
				[2,7],
				[4,2],
				[6,8],
				[3,8],
				[3,9],];	
var level=1;
var diff='困難';
var task=[{mode:3,name:"間諜先生在哪?", str:"幫忙找出藏匿地點的數字\n\n任務1：把大的點加在一起。\n(小提示：直接在鍵盤輸入數字，寫好了再按右方答案確定唷~)"}];

var next_page = "../advanced_challenge_level_select.html";
var fail_page = "adv_lose.html";