var answer = 1752;
var dot_data = [[2,2,5,0,1],
				[2,4,7,1,0],
				[2,6,9,0,1],
				[4,3,2,0,1],
				[4,5,0,0,1],
				[6,4,0,0,1],
				[7,3,28,1,0],
				[8,4,0,0,1],
				[10,3,15,0,0],
				[10,5,0,0,1],
				[12,2,0,0,1],
				[12,4,0,1,0],
				[12,6,3,0,0]];
var line_data= [[0,1],
				[1,3],
				[3,0],
				[1,2],
				[4,1],
				[4,2],
				[4,3],
				[4,5],
				[5,3],
				[6,5],
				[6,7],
				[5,7],
				[8,7],
				[9,7],
				[8,9],
				[8,10],
				[8,11],
				[10,11],
				[9,12],
				[9,11],
				[12,11]];	
var level=2;
var diff='簡單';
var task=[{mode:3,name:"武器", str:"解開這份文件，找出秘密武器到底是什麼?\n任務1：\n把大的點加起來。\n(小提示：直接在鍵盤輸入數字，寫好了再按右方答案確定唷~)"}];

var next_page = "easy_level2_e.html";
var fail_page = "easy_lose.html";