var answer = 421;
var dot_data = [[1,1,2,0,1],
				[2,7,7,0,0],
				[2,4,10,0,1],
				[5,1,11,1,1],
				[9,3,9,0,1],
				[7,7,1,1,1],
				[11,4,2,0,0],
				[13,2,3,0,0],
				[7,5,14,0,1],
				[14,6,5,0,0],
				[13,4,6,0,0],
				[9,2,13,0,1],
				[6,3,4,0,1]];
var line_data= [[0,1],
				[1,2],
				[1,5],
				[3,6],
				[4,6],
				[7,6],
				[0,3],
				[0,2],
				[2,3],
				[8,5],
				[3,4],
				[5,6],
				[8,1],
				[8,2],
				[8,6],
				[8,4],
				[2,12],
				[4,12],
				[3,12],
				[3,7],
				[3,11],
				[7,11],
				[11,4],
				[10,5],
				[10,7],
				[10,9],
				[9,5],
				[7,9],
				];	
var level=3;
var diff='困難';
var task=[{mode:3,name:"藥水", str:"幫忙解開恢復藥水數字\n\n任務1：\n將大點加在一起。\n(小提示：直接在鍵盤輸入數字，寫好了再按右方答案確定唷~)"}];

var next_page = "../advanced_challenge_level_select.html";
var fail_page = "adv_lose.html";