var answer = 100;
var dot_data = [[5,2,10,0,0],
				[7,3,0,0,0],
				[9,2,15,0,1],
				[11,3,0,1,1],
				[10,5,3,0,1],
				[7,6,12,0,0],
				[4,5,0,1,0],
				[3,3,0,0,1]];
var line_data= [[0,1],
				[1,2],
				[2,3],
				[3,4],
				[4,5],
				[5,6],
				[6,7],
				[0,6],
				[2,4],
				[6,1],
				[4,1],
				[0,7],
				[1,5]];	
var level=1;
var diff='簡單';
var task=[{mode:3,name:"密函", str:"幫忙解開這份文件的密碼\n\n任務1：\n把大點的數字加起來!\n(小提示：直接在鍵盤輸入數字，寫好了再按右方答案確定唷~)"}];

var next_page = "easy_level1_e.html";
var fail_page = "easy_lose.html";